{
    "start": "Welcome to use this bot! Your messages will be forwarded to the admin.\nUse /togglenotification to toggle message notifications (disabled by default).",
    "set_admin_successful": "Admin successfully set! You now have full control.",
    "set_admin_failed": "Admin already set. Edit the config.json file manually to change it.",
    "togglenotification_on": "Message notifications enabled. You’ll receive a confirmation when your message is forwarded.",
    "togglenotification_off": "Message notifications disabled. You won’t receive any confirmation for forwarded messages.",
    "info_data": "Sender: %s [Link](tg://user?id=%s)",
    "message_received_notification": "Your message has been forwarded to the admin.",
    "reply_to_no_message": "Please reply to an existing message to proceed.",
    "reply_to_message_no_data": "No data available for this message. Cannot reply or inquire.",
    "reply_type_not_supported": "The bot doesn’t support replying to this type of message.",
    "reply_message_sent": "Replied successfully.\nReceiver: %s [Link](tg://user?id=%s)",
    "please_setup_first": "Configuration incomplete. Please complete the setup first.",
    "blocked_alert": "The user has stopped the bot, so you can no longer reply.",
    "reply_message_failed": "Failed to send reply. Please try again later.",
    "be_blocked_alert": "You are banned from sending messages to the admin. Contact support for more info.",
    "ban_user": "User %s [Link](tg://user?id=%s) has been banned from using the bot.",
    "unban_user": "User %s [Link](tg://user?id=%s) has been unbanned and can now use the bot.",
    "nonexistent_command": "Command not recognized. Please check your input and try again.",
    "not_an_admin": "You do not have the required permissions to perform this action.",
    "reply_or_enter_id": "Please reply to a message or provide the banned user's ID.",
    "user_not_found": "No user found with the provided ID.",
    "be_unbanned": "You have been unbanned and can now send messages to the admin."
}
